NDJSec/FALCON/knowledge_base/svd/data/Atmel/ATSAMA5D31.svd
        <register>
          <name>CFG6</name>
          <description>DMAC Channel Configuration Register (ch_num = 6)</description>
          <addressOffset>0x00000140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x01000000</resetValue>
          <fields>
            <field>
              <name>SRC_PER</name>
              <description>Source with Peripheral identifier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DST_PER</name>
              <description>Destination with Peripheral identifier</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRC_REP</name>
              <description>Source Reloaded from Previous</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONTIGUOUS_ADDR</name>
                  <description>When automatic mode is activated, source address is contiguous between two buffers.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RELOAD_ADDR</name>
                  <description>When automatic mode is activated, the source address and the control register are reloaded from previous transfer.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRC_H2SEL</name>
              <description>Software or Hardware Selection for the Source</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SW</name>
                  <description>Software handshaking interface is used to trigger a transfer request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HW</name>
                  <description>Hardware handshaking interface is used to trigger a transfer request.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRC_PER_MSB</name>
              <description>SRC_PER Most Significant Bits</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DST_REP</name>
              <description>Destination Reloaded from Previous</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONTIGUOUS_ADDR</name>
                  <description>When automatic mode is activated, destination address is contiguous between two buffers.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RELOAD_ADDR</name>
                  <description>When automatic mode is activated, the destination and the control register are reloaded from the pre-vious transfer.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DST_H2SEL</name>
              <description>Software or Hardware Selection for the Destination</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SW</name>
                  <description>Software handshaking interface is used to trigger a transfer request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HW</name>
                  <description>Hardware handshaking interface is used to trigger a transfer request.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DST_PER_MSB</name>
              <description>DST_PER Most Significant Bits</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOD</name>
              <description>Stop On Done</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>STOP ON DONE disabled, the descriptor fetch operation ignores DONE Field of CTRLA register.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>STOP ON DONE activated, the DMAC module is automatically disabled if DONE FIELD is set to 1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_IF</name>
              <description>Interface Lock</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Interface Lock capability is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Interface Lock capability is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_B</name>
              <description>Bus Lock</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>AHB Bus Locking capability is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_IF_L</name>
              <description>Master Interface Arbiter Lock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHUNK</name>
                  <description>The Master Interface Arbiter is locked by the channel x for a chunk transfer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUFFER</name>
                  <description>The Master Interface Arbiter is locked by the channel x for a buffer transfer.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHB_PROT</name>
              <description>AHB Protection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFOCFG</name>
              <description>FIFO Configuration</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALAP_CFG</name>
                  <description>The largest defined length AHB burst is performed on the destination AHB interface.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALF_CFG</name>
                  <description>When half FIFO size is available/filled, a source/destination request is serviced.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASAP_CFG</name>
                  <description>When there is enough space/data available to perform a single AHB access, then the request is serviced.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SPIP6</name>
          <description>DMAC Channel Source Picture-in-Picture Configuration Register (ch_num = 6)</description>
          <addressOffset>0x00000144</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SPIP_HOLE</name>
              <description>Source Picture-in-Picture Hole</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPIP_BOUNDARY</name>
              <description>Source Picture-in-Picture Boundary</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPIP6</name>
          <description>DMAC Channel Destination Picture-in-Picture Configuration Register (ch_num = 6)</description>
          <addressOffset>0x00000148</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DPIP_HOLE</name>
              <description>Destination Picture-in-Picture Hole</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPIP_BOUNDARY</name>
              <description>Destination Picture-in-Picture Boundary</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SADDR7</name>
          <description>DMAC Channel Source Address Register (ch_num = 7)</description>
          <addressOffset>0x00000154</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SADDR</name>
              <description>Channel x Source Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DADDR7</name>
          <description>DMAC Channel Destination Address Register (ch_num = 7)</description>
          <addressOffset>0x00000158</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DADDR</name>
              <description>Channel x Destination Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSCR7</name>
          <description>DMAC Channel Descriptor Address Register (ch_num = 7)</description>
          <addressOffset>0x0000015C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DSCR_IF</name>
              <description>Descriptor Interface Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AHB_IF0</name>
                  <description>The buffer transfer descriptor is fetched via AHB-Lite Interface 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_IF1</name>
                  <description>The buffer transfer descriptor is fetched via AHB-Lite Interface 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_IF2</name>
                  <description>The buffer transfer descriptor is fetched via AHB-Lite Interface 2</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSCR</name>
              <description>Buffer Transfer Descriptor Address</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLA7</name>
          <description>DMAC Channel Control A Register (ch_num = 7)</description>
          <addressOffset>0x00000160</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BTSIZE</name>
              <description>Buffer Transfer Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCSIZE</name>
              <description>Source Chunk Transfer Size.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHK_1</name>
                  <description>1 data transferred</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHK_4</name>
                  <description>4 data transferred</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHK_8</name>
                  <description>8 data transferred</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHK_16</name>
                  <description>16 data transferred</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCSIZE</name>
              <description>Destination Chunk Transfer Size</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHK_1</name>
                  <description>1 data transferred</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHK_4</name>
                  <description>4 data transferred</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHK_8</name>
                  <description>8 data transferred</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHK_16</name>
                  <description>16 data transferred</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRC_WIDTH</name>
              <description>Transfer Width for the Source</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BYTE</name>
                  <description>the transfer size is set to 8-bit width</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALF_WORD</name>
                  <description>the transfer size is set to 16-bit width</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORD</name>
                  <description>the transfer size is set to 32-bit width</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DWORD</name>
                  <description>the transfer size is set to 64-bit width</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DST_WIDTH</name>
              <description>Transfer Width for the Destination</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BYTE</name>
                  <description>the transfer size is set to 8-bit width</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALF_WORD</name>
                  <description>the transfer size is set to 16-bit width</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORD</name>
                  <description>the transfer size is set to 32-bit width</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DWORD</name>
                  <description>the transfer size is set to 64-bit width</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DONE</name>
              <description>Current Descriptor Stop Command and Transfer Completed Memory Indicator</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
