NDJSec/FALCON/knowledge_base/svd/data/Atmel/ATSAMA5D31.svd
        <register>
          <name>LPR</name>
          <description>MPDDRC Low-power Register</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LPCB</name>
              <description>Low-power Command Bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Low-power Feature is inhibited. No power-down, self refresh and deep-power modes are issued to the DDR-SDRAM device.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELFREFRESH</name>
                  <description>The MPDDRC issues a Self Refresh command to the DDR-SDRAM device, the clock(s) is/are de-activated and the CKE signal is set low. The DDR-SDRAM device leaves the self refresh mode when accessed and reenters it after the access.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWERDOWN</name>
                  <description>The MPDDRC issues a Power-down Command to the DDR-SDRAM device after each access, the CKE signal is set low. The DDR-SDRAM device leaves the power-down mode when accessed and reenters it after the access.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEEP_PWD</name>
                  <description>The MPDDRC issues a Deep Power-down command to the Low-power DDR-SDRAM device.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLK_FR</name>
              <description>Clock Frozen Command Bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Clock(s) is/are not frozen.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Clock(s) is/are frozen.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPDDR2_PWOFF</name>
              <description>LPDDR2 Power Off Bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>No power off sequence applied to LPDDR2.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>A power off sequence is applied to the LPDDR2 device. CKE is forced low.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PASR</name>
              <description>Partial Array Self Refresh</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DS</name>
              <description>Drive Strength</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEOUT</name>
              <description>Enter Low-power Mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The SDRAM controller activates the SDRAM low-power mode immediately after the end of the last transfer.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <description>The SDRAM controller activates the SDRAM low-power mode 64 clock cycles after the end of the last transfer.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128</name>
                  <description>The SDRAM controller activates the SDRAM low-power mode 128 clock cycles after the end of the last transfer.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APDE</name>
              <description>Active Power Down Exit Time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAST</name>
                  <description>Fast Exit.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLOW</name>
                  <description>Low Exit.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UPD_MR</name>
              <description>Update Load Mode Register and Extended Mode Register</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Update is disabled.</description>
                  <value>00</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MD</name>
          <description>MPDDRC Memory Device Register</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>MD</name>
              <description>Memory Device</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPDDR_SDRAM</name>
                  <description>Low-power DDR1-SDRAM</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DDR2_SDRAM</name>
                  <description>DDR2-SDRAM</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPDDR2_SDRAM</name>
                  <description>Low-Power DDR2-SDRAM</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBW</name>
              <description>Data Bus Width</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DBW_32_BITS</name>
                  <description>Data bus width is 32 bits.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBW_16_BITS</name>
                  <description>Data bus width is 16 bits.(1)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HS</name>
          <description>MPDDRC High Speed Register</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DIS_ANTICIP_READ</name>
              <description>Disable Anticip Read Access</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPDDR2_LPR</name>
          <description>MPDDRC LPDDR2 Low-power Register</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BK_MASK_PASR</name>
              <description>Bank Mask Bit/PASR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEG_MASK</name>
              <description>Segment Mask Bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DS</name>
              <description>Drive strength</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPDDR2_CAL_MR4</name>
          <description>MPDDRC LPDDR2 Calibration and MR4 Register</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COUNT_CAL</name>
              <description>LPDDR2 Calibration Timer Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MR4_READ</name>
              <description>Mode Register 4 Read Interval</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPDDR2_TIM_CAL</name>
          <description>MPDDRC LPDDR2 Timing Calibration Register</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000040</resetValue>
          <fields>
            <field>
              <name>ZQCS</name>
              <description>ZQ Calibration Short</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IO_CALIBR</name>
          <description>MPDDRC IO Calibration</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00870002</resetValue>
          <fields>
            <field>
              <name>RDIV</name>
              <description>Resistor Divider, output driver impedance</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RZQ_34</name>
                  <description>LPDDR2 RZQ = 34,3 Ohm, DDR2/LPDDR1: Not applicable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RZQ_40_RZQ_33_3</name>
                  <description>LPDDR2:RZQ = 40 Ohm, DDR2/LPDDR1: RZQ = 33,3 Ohm</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RZQ_48_RZQ_40</name>
                  <description>LPDDR2:RZQ =48 Ohm, DDR2/LPDDR1: RZQ =40 Ohm</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RZQ_60_RZQ_50</name>
                  <description>LPDDR2:RZQ =60 Ohm, DDR2/LPDDR1: RZQ =50 Ohm</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RZQ_80_RZQ_66_7</name>
                  <description>LPDDR2: RZQ = 80 Ohm, DDR2/LPDDR1: RZQ = 66,7 Ohm</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RZQ_120_RZQ_100</name>
                  <description>LPDDR2:RZQ = 120 Ohm, DDR2/LPDDR1: RZQ = 100 Ohm</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TZQIO</name>
              <description>IO Calibration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CALCODEP</name>
              <description>Number of Transistor P</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CALCODEN</name>
              <description>Number of Transistor N</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>SAW[%s]</name>
          <description>MPDDRC Smart Adaptation Wrapper 0 Register</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FLUSH_MAX</name>
              <description>Clears FIFO Content</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INCR_THRESH</name>
              <description>Incremental Threshold</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <description>1 word/dword max</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>2 word/dword max</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>4 word/dword max</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>8 word/dword max</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>16 word/dword max</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <description>32 word/dword max</description>
                  <value>0x20</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PFCH_THRESH</name>
              <description>Prefetch Threshold</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2</name>
                  <description>2 word/dword max</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>4 word/dword max</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>8 word/dword max</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DLL_MO</name>
          <description>MPDDRC DLL Master Offset Register</description>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MOFF</name>
              <description>DLL Master Delay Line Offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK90OFF</name>
              <description>DLL CLK90 Delay Line Offset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SELOFF</name>
              <description>DLL Offset Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DLL_SOF</name>
          <description>MPDDRC DLL Slave Offset Register</description>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>S0OFF</name>
              <description>DLL Slave 0 Delay Line Offset ([x=0..3])</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S1OFF</name>
              <description>DLL Slave 1 Delay Line Offset ([x=0..3])</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S2OFF</name>
              <description>DLL Slave 2 Delay Line Offset ([x=0..3])</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S3OFF</name>
              <description>DLL Slave 3 Delay Line Offset ([x=0..3])</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DLL_MS</name>
          <description>MPDDRC DLL Status Master  Register</description>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MDINC</name>
              <description>DLL Master Delay Increment</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MDDEC</name>
              <description>DLL Master Delay Decrement</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MDOVF</name>
              <description>DLL Master Delay Overflow Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MDVAL</name>
              <description>DLL Master Delay Value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>DLL_SS[%s]</name>
          <description>MPDDRC DLL Status Slave 0  Register</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SDCOVF</name>
              <description>DLL Slave x Delay Correction Overflow Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SDCUDF</name>
              <description>DLL Slave x Delay Correction Underflow Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SDERF</name>
              <description>DLL Slave x Delay Correction Error Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SDVAL</name>
              <description>DLL Slave x Delay Value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SDCVAL</name>
              <description>DLL Slave x Delay Correction Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
